emacs.org
#+title: Emacs Config
#+author: will@wmedrano.dev

* Packages

** Melpa

Add Melpa to the package manager. [[https://melpa.org][Melpa]] contains many popular Emacs packages.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
#+END_SRC

Counting the default package archives, the following package archives are
available.

#+BEGIN_SRC emacs-lisp :exports both
  (cl-loop for package-archive in package-archives
           collect (list (car package-archive) (cdr package-archive)))
#+END_SRC

#+RESULTS:
| gnu    | https://elpa.gnu.org/packages/  |
| nongnu | https://elpa.nongnu.org/nongnu/ |
| melpa  | https://melpa.org/packages/     |

Package archives must be manually refreshed or fetched with ~M-x
package-refresh-contents~. All packages added to the ~package-selected-packages~
variable can be installed with ~M-x package-install-selected-packages~. Packages
can also be installed on a one-off basis interactively with ~M-x
package-install~.

In some cases, package installation may fail with "... not found". This likely
means that the package archives point to an old (and non-existant) version of
the package. The package definitions can be updated by running ~M-x
package-refresh-contents~. Packages may also be upgraded all at once with ~M-x
package-upgrade-all~.

** Initialize

Initialize the package archive. This makes all previously installed packages available.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (package-initialize)
#+END_SRC

* Startup

Disable the default Emacs startup screen. Instead, this displays just the opened
file or the ~*Scratch*~ buffer if no file has been opened.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq-default inhibit-startup-screen t)
#+END_SRC

* File System

** Auto-Revert

Auto revert mode automatically reloads file-based buffer's when their files have
been updated.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (global-auto-revert-mode t)
#+END_SRC

** Backups & Autosaves

Backup and autosaves may litter the filesystem so we disable
them. This is ok as my disk is reliable, I save often, and use version
control.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq-default auto-save-interval 0
                create-lockfiles   nil
                make-backup-files  nil)
#+END_SRC

* Performance

Increase the amount of memory allowed before garbage collection kicks in. Emacs
runs garbage collection when it is over the limit. The limit is equal to the
amount of memory that is ~actively-used~ plus ~used-memory *
gc-cons-percentage~. Once the limit is reached, Emacs runs garbage collection
and recomputes the amount of memory that is ~actively-used~.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq-default gc-cons-percentage 1.0)
#+END_SRC

Run the garbage collector on idle, every 3 seconds. This reduces the chances of
a GC run when interacting with Emacs.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (run-with-idle-timer 3 t #'garbage-collect)
#+END_SRC

* Appearance & Feel

