emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-27 Tue 22:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Config</title>
<meta name="author" content="will@wmedrano.dev" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs Config</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org506292a">1. Packages</a>
<ul>
<li><a href="#org474e88d">1.1. Melpa</a></li>
<li><a href="#orgeb633f1">1.2. Initialize</a></li>
</ul>
</li>
<li><a href="#org8c36c67">2. Startup</a></li>
<li><a href="#org7946504">3. File System</a>
<ul>
<li><a href="#org8e5fa82">3.1. Auto-Revert</a></li>
<li><a href="#orga328505">3.2. Backups &amp; Autosaves</a></li>
</ul>
</li>
<li><a href="#orge9d82c8">4. Performance</a></li>
<li><a href="#orgb914e67">5. Appearance &amp; Feel</a>
<ul>
<li><a href="#org0dfb651">5.1. Remove Clutter</a></li>
<li><a href="#org9cbbdcd">5.2. Lines</a></li>
<li><a href="#orga5af1bd">5.3. Color Scheme</a></li>
<li><a href="#orga00aa87">5.4. Modeline</a></li>
</ul>
</li>
<li><a href="#org1448e58">6. Editor Completions</a>
<ul>
<li><a href="#orgf777027">6.1. Ivy</a></li>
<li><a href="#orge93a936">6.2. Counsel</a></li>
</ul>
</li>
<li><a href="#orga9f7949">7. LSP</a>
<ul>
<li><a href="#org6b460af">7.1. Background</a></li>
<li><a href="#org4621dc4">7.2. Updating Eglot Package</a></li>
<li><a href="#orgc45444a">7.3. Obtaining Language Servers</a></li>
<li><a href="#org1f1cfbe">7.4. Enabling Eglot</a></li>
</ul>
</li>
<li><a href="#org147c1d0">8. Formatting</a>
<ul>
<li><a href="#orgb77b17d">8.1. Tabs</a></li>
<li><a href="#org4c6e6b8">8.2. Line Width</a></li>
<li><a href="#orgc0de00f">8.3. Delete Trailing Whitespace</a></li>
<li><a href="#orgf88a19e">8.4. Language Specific Autoformat</a></li>
</ul>
</li>
<li><a href="#org68ef613">9. Code Auto-Complete</a></li>
<li><a href="#orgaa83484">10. Languages</a>
<ul>
<li><a href="#org0b08594">10.1. Rust</a></li>
<li><a href="#org7f149ae">10.2. Org Mode</a></li>
</ul>
</li>
<li><a href="#orge7a83b3">11. Elisp Concepts</a>
<ul>
<li><a href="#orgdac3d8b">11.1. Interactive Commands</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org506292a" class="outline-2">
<h2 id="org506292a"><span class="section-number-2">1.</span> Packages</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org474e88d" class="outline-3">
<h3 id="org474e88d"><span class="section-number-3">1.1.</span> Melpa</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Add Melpa to the package manager. <a href="https://melpa.org">Melpa</a> contains many popular Emacs packages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">package</span>)
(add-to-list 'package-archives '(<span style="color: #8b2252;">"melpa"</span> . <span style="color: #8b2252;">"https://melpa.org/packages/"</span>) t)
</pre>
</div>

<p>
Counting the default package archives, the following package archives are
available.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">cl-loop</span> for package-archive in package-archives
         collect (list (car package-archive) (cdr package-archive)))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">gnu</td>
<td class="org-left"><a href="https://elpa.gnu.org/packages/">https://elpa.gnu.org/packages/</a></td>
</tr>

<tr>
<td class="org-left">nongnu</td>
<td class="org-left"><a href="https://elpa.nongnu.org/nongnu/">https://elpa.nongnu.org/nongnu/</a></td>
</tr>

<tr>
<td class="org-left">melpa</td>
<td class="org-left"><a href="https://melpa.org/packages/">https://melpa.org/packages/</a></td>
</tr>
</tbody>
</table>

<p>
Package archives must be manually refreshed or fetched with <code>M-x
package-refresh-contents</code>. All packages added to the <code>package-selected-packages</code>
variable can be installed with <code>M-x package-install-selected-packages</code>. Packages
can also be installed on a one-off basis interactively with <code>M-x
package-install</code>.
</p>

<p>
In some cases, package installation may fail with "&#x2026; not found". This likely
means that the package archives point to an old (and non-existant) version of
the package. The package definitions can be updated by running <code>M-x
package-refresh-contents</code>. Packages may also be upgraded all at once with <code>M-x
package-upgrade-all</code>.
</p>
</div>
</div>
<div id="outline-container-orgeb633f1" class="outline-3">
<h3 id="orgeb633f1"><span class="section-number-3">1.2.</span> Initialize</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Initialize the package archive. This makes all previously installed packages available.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(package-initialize)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8c36c67" class="outline-2">
<h2 id="org8c36c67"><span class="section-number-2">2.</span> Startup</h2>
<div class="outline-text-2" id="text-2">
<p>
Disable the default Emacs startup screen. Instead, this displays just the opened
file or the <code>*Scratch*</code> buffer if no file has been opened.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">setq-default</span> inhibit-startup-screen t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org7946504" class="outline-2">
<h2 id="org7946504"><span class="section-number-2">3.</span> File System</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org8e5fa82" class="outline-3">
<h3 id="org8e5fa82"><span class="section-number-3">3.1.</span> Auto-Revert</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Auto revert mode automatically reloads file-based buffer's when their files have
been updated.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-auto-revert-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga328505" class="outline-3">
<h3 id="orga328505"><span class="section-number-3">3.2.</span> Backups &amp; Autosaves</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Backup and autosaves may litter the filesystem so we disable
them. This is ok as my disk is reliable, I save often, and use version
control.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">setq-default</span> auto-save-interval 0
              create-lockfiles   nil
              make-backup-files  nil)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge9d82c8" class="outline-2">
<h2 id="orge9d82c8"><span class="section-number-2">4.</span> Performance</h2>
<div class="outline-text-2" id="text-4">
<p>
Increase the amount of memory allowed before garbage collection kicks in. Emacs
runs garbage collection when it is over the limit. The limit is equal to the
amount of memory that is <code>actively-used</code> plus <code>used-memory *
gc-cons-percentage</code>. Once the limit is reached, Emacs runs garbage collection
and recomputes the amount of memory that is <code>actively-used</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">setq-default</span> gc-cons-percentage 1.0)
</pre>
</div>

<p>
Run the garbage collector on idle, every 3 seconds. This reduces the chances of
a GC run when interacting with Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(run-with-idle-timer 3 t #'garbage-collect)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb914e67" class="outline-2">
<h2 id="orgb914e67"><span class="section-number-2">5.</span> Appearance &amp; Feel</h2>
<div class="outline-text-2" id="text-5">
</div>
