emacs.tex
% Created 2025-05-27 Tue 22:16
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{will@wmedrano.dev}
\date{\today}
\title{Emacs Config}
\hypersetup{
 pdfauthor={will@wmedrano.dev},
 pdftitle={Emacs Config},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Packages}
\label{sec:orgb8eeab2}

\subsection{Melpa}
\label{sec:org72b9ee1}

Add Melpa to the package manager. \href{https://melpa.org}{Melpa} contains many popular Emacs packages.

\begin{verbatim}
(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
\end{verbatim}

Counting the default package archives, the following package archives are
available.

\begin{verbatim}
(cl-loop for package-archive in package-archives
         collect (list (car package-archive) (cdr package-archive)))
\end{verbatim}

\begin{table}[htbp]
\label{tab:orgb8efd10}
\centering
\begin{tabular}{ll}
gnu & \url{https://elpa.gnu.org/packages/}\\
nongnu & \url{https://elpa.nongnu.org/nongnu/}\\
melpa & \url{https://melpa.org/packages/}\\
\end{tabular}
\end{table}

Package archives must be manually refreshed or fetched with \texttt{M-x
package-refresh-contents}. All packages added to the \texttt{package-selected-packages}
variable can be installed with \texttt{M-x package-install-selected-packages}. Packages
can also be installed on a one-off basis interactively with \texttt{M-x
package-install}.

In some cases, package installation may fail with "\ldots{} not found". This likely
means that the package archives point to an old (and non-existant) version of
the package. The package definitions can be updated by running \texttt{M-x
package-refresh-contents}. Packages may also be upgraded all at once with \texttt{M-x
package-upgrade-all}.
\subsection{Initialize}
\label{sec:org06bd52c}

Initialize the package archive. This makes all previously installed packages available.

\begin{verbatim}
(package-initialize)
\end{verbatim}
\section{Startup}
\label{sec:org45070f8}

Disable the default Emacs startup screen. Instead, this displays just the opened
file or the \texttt{*Scratch*} buffer if no file has been opened.

\begin{verbatim}
(setq-default inhibit-startup-screen t)
\end{verbatim}
\section{File System}
\label{sec:orgc64a768}

\subsection{Auto-Revert}
\label{sec:orge1b0e6a}

Auto revert mode automatically reloads file-based buffer's when their files have
been updated.

\begin{verbatim}
(global-auto-revert-mode t)
\end{verbatim}
\subsection{Backups \& Autosaves}
\label{sec:org903d748}

Backup and autosaves may litter the filesystem so we disable
them. This is ok as my disk is reliable, I save often, and use version
control.

\begin{verbatim}
(setq-default auto-save-interval 0
              create-lockfiles   nil
              make-backup-files  nil)
\end{verbatim}
\section{Performance}
\label{sec:org1bc33ae}

Increase the amount of memory allowed before garbage collection kicks in. Emacs
runs garbage collection when it is over the limit. The limit is equal to the
amount of memory that is \texttt{actively-used} plus \texttt{used-memory *
gc-cons-percentage}. Once the limit is reached, Emacs runs garbage collection
and recomputes the amount of memory that is \texttt{actively-used}.

\begin{verbatim}
(setq-default gc-cons-percentage 1.0)
\end{verbatim}

Run the garbage collector on idle, every 3 seconds. This reduces the chances of
a GC run when interacting with Emacs.

\begin{verbatim}
(run-with-idle-timer 3 t #'garbage-collect)
\end{verbatim}
\section{Appearance \& Feel}
\label{sec:org2e5e82e}
