emacs.org
** Remove Clutter

Remove the menu bar and tool bar.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (menu-bar-mode -1)
  (tool-bar-mode -1)
#+END_SRC

Disable the scroll bar. The functionality is ok sometimes, but it clashes with
the theming.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (scroll-bar-mode -1)
#+END_SRC

** Lines

Scroll conservatively values above 100 cause Emacs to scroll the
minimum number of lines required to get the cursor in position. The
default value of 0 causes Emacs to recenter the window.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq-default scroll-conservatively 101)
#+END_SRC

Display line numbers for text buffers. This can be toggled in an individual
buffer with ~M-x display-line-numbers-mode~.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (global-display-line-numbers-mode t)
#+END_SRC

Highlight the currently selected line. This can be toggled in an individual
buffer with ~M-x hl-line-mode~.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (global-hl-line-mode t)
#+END_SRC

** Color Scheme

Use the ~doom-dracula~ theme from the [[https://github.com/doomemacs/themes/tree/729ad034631cba41602ad9191275ece472c21941][Doom Themes]] package.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-to-list 'package-selected-packages 'doom-themes)
  (load-theme 'doom-dracula t)
#+END_SRC

** Modeline

Use [[https://github.com/seagle0128/doom-modeline/tree/297b57585fe3b3de9e694512170c44c6e104808f][Doom Modeline]] to display a nicer modeline. Mainly, it:

- Uses more icons.
- Displays a minimal amount of information while still keeping
  important information such as:
  - Syntax errors
  - Version control information

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-to-list 'package-selected-packages 'doom-themes)
  (doom-modeline-mode t)
#+END_SRC

* Editor Completions

Editor completions refers to auto complete done within the editor context, as
opposed to code. Editor completion is used to complete prompts for things such
as selecting a file, buffer, or command.

** Ivy

Editor completions are displayed using the [[https://github.com/abo-abo/swiper?tab=readme-ov-file#ivy][Ivy]] package. This provides a huge
improvement over the default built-in Emacs completion.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-to-list 'package-selected-packages 'ivy)
  (ivy-mode t)
#+END_SRC

** Counsel

[[https://github.com/abo-abo/swiper?tab=readme-ov-file#counsel][Counsel]] provides functions that wrap ivy completion with some extra
features. For example, ~counsel-M-x~ is an ~M-x~ replacement that also displays
a keybinding if there is an active keybinding for the particular function.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-to-list 'package-selected-packages 'counsel)
  (counsel-mode t)
#+END_SRC

Enabling ~counsel-mode~ makes the ~counsel-mode-map~ keymap active. This keymap
defines several rebinds.


However, it does not provide a rebind for ~counsel-switch-buffer~. We make this
our default (interactive) switch buffer command as it allows previewing the
contents of a buffer before switching.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (define-key counsel-mode-map (kbd "C-x b") #'counsel-switch-buffer)
#+END_SRC

* LSP

** Background
The LanguageServerProtocol defines a way for a language server to communicate
programming language specific information for a project to an IDE(Emacs). The
protocol defines things such as syntax checking, autocomplete, and code
formatting.

** Updating Eglot Package

Eglot is included in Emacs. However, Eglot can be upgraded to the latest version
with ~M-x eglot-upgrade-eglot~.

** Obtaining Language Servers

Eglot is configured to run the most popular language servers by
default. However, they must still be installed on the system. Some popular
language servers include ~rust-analyzer~ for Rust.

** Enabling Eglot

Eglot can be manually enabled on a buffer with ~M-x eglot~. To enable it
automatically, you may call ~eglot-ensure~ on the buffer automatically through
hooks.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'rust-mode-hook #'eglot-ensure)
#+END_SRC

* Formatting

