emacs.html
<div id="outline-container-org0dfb651" class="outline-3">
<h3 id="org0dfb651"><span class="section-number-3">5.1.</span> Remove Clutter</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Remove the menu bar and tool bar.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(menu-bar-mode -1)
(tool-bar-mode -1)
</pre>
</div>

<p>
Disable the scroll bar. The functionality is ok sometimes, but it clashes with
the theming.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(scroll-bar-mode -1)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9cbbdcd" class="outline-3">
<h3 id="org9cbbdcd"><span class="section-number-3">5.2.</span> Lines</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Scroll conservatively values above 100 cause Emacs to scroll the
minimum number of lines required to get the cursor in position. The
default value of 0 causes Emacs to recenter the window.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">setq-default</span> scroll-conservatively 101)
</pre>
</div>

<p>
Display line numbers for text buffers. This can be toggled in an individual
buffer with <code>M-x display-line-numbers-mode</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-display-line-numbers-mode t)
</pre>
</div>

<p>
Highlight the currently selected line. This can be toggled in an individual
buffer with <code>M-x hl-line-mode</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-hl-line-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga5af1bd" class="outline-3">
<h3 id="orga5af1bd"><span class="section-number-3">5.3.</span> Color Scheme</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Use the <code>doom-dracula</code> theme from the <a href="https://github.com/doomemacs/themes/tree/729ad034631cba41602ad9191275ece472c21941">Doom Themes</a> package.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'package-selected-packages 'doom-themes)
(load-theme 'doom-dracula t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga00aa87" class="outline-3">
<h3 id="orga00aa87"><span class="section-number-3">5.4.</span> Modeline</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Use <a href="https://github.com/seagle0128/doom-modeline/tree/297b57585fe3b3de9e694512170c44c6e104808f">Doom Modeline</a> to display a nicer modeline. Mainly, it:
</p>

<ul class="org-ul">
<li>Uses more icons.</li>
<li>Displays a minimal amount of information while still keeping
important information such as:
<ul class="org-ul">
<li>Syntax errors</li>
<li>Version control information</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'package-selected-packages 'doom-themes)
(doom-modeline-mode t)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1448e58" class="outline-2">
<h2 id="org1448e58"><span class="section-number-2">6.</span> Editor Completions</h2>
<div class="outline-text-2" id="text-6">
<p>
Editor completions refers to auto complete done within the editor context, as
opposed to code. Editor completion is used to complete prompts for things such
as selecting a file, buffer, or command.
</p>
</div>
<div id="outline-container-orgf777027" class="outline-3">
<h3 id="orgf777027"><span class="section-number-3">6.1.</span> Ivy</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Editor completions are displayed using the <a href="https://github.com/abo-abo/swiper?tab=readme-ov-file#ivy">Ivy</a> package. This provides a huge
improvement over the default built-in Emacs completion.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'package-selected-packages 'ivy)
(ivy-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge93a936" class="outline-3">
<h3 id="orge93a936"><span class="section-number-3">6.2.</span> Counsel</h3>
<div class="outline-text-3" id="text-6-2">
<p>
<a href="https://github.com/abo-abo/swiper?tab=readme-ov-file#counsel">Counsel</a> provides functions that wrap ivy completion with some extra
features. For example, <code>counsel-M-x</code> is an <code>M-x</code> replacement that also displays
a keybinding if there is an active keybinding for the particular function.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'package-selected-packages 'counsel)
(counsel-mode t)
</pre>
</div>

<p>
Enabling <code>counsel-mode</code> makes the <code>counsel-mode-map</code> keymap active. This keymap
defines several rebinds.
</p>


<p>
However, it does not provide a rebind for <code>counsel-switch-buffer</code>. We make this
our default (interactive) switch buffer command as it allows previewing the
contents of a buffer before switching.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key counsel-mode-map (kbd <span style="color: #8b2252;">"C-x b"</span>) #'counsel-switch-buffer)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga9f7949" class="outline-2">
<h2 id="orga9f7949"><span class="section-number-2">7.</span> LSP</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org6b460af" class="outline-3">
<h3 id="org6b460af"><span class="section-number-3">7.1.</span> Background</h3>
<div class="outline-text-3" id="text-7-1">
<p>
The LanguageServerProtocol defines a way for a language server to communicate
programming language specific information for a project to an IDE(Emacs). The
protocol defines things such as syntax checking, autocomplete, and code
formatting.
</p>
</div>
</div>
<div id="outline-container-org4621dc4" class="outline-3">
<h3 id="org4621dc4"><span class="section-number-3">7.2.</span> Updating Eglot Package</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Eglot is included in Emacs. However, Eglot can be upgraded to the latest version
with <code>M-x eglot-upgrade-eglot</code>.
</p>
</div>
</div>
<div id="outline-container-orgc45444a" class="outline-3">
<h3 id="orgc45444a"><span class="section-number-3">7.3.</span> Obtaining Language Servers</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Eglot is configured to run the most popular language servers by
default. However, they must still be installed on the system. Some popular
language servers include <code>rust-analyzer</code> for Rust.
</p>
</div>
</div>
<div id="outline-container-org1f1cfbe" class="outline-3">
<h3 id="org1f1cfbe"><span class="section-number-3">7.4.</span> Enabling Eglot</h3>
<div class="outline-text-3" id="text-7-4">
<p>
Eglot can be manually enabled on a buffer with <code>M-x eglot</code>. To enable it
automatically, you may call <code>eglot-ensure</code> on the buffer automatically through
hooks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'rust-mode-hook #'eglot-ensure)
</pre>
</div>
</div>
</div>
</div>
