emacs.tex

\subsection{Remove Clutter}
\label{sec:orgd8c70e6}

Remove the menu bar and tool bar.

\begin{verbatim}
(menu-bar-mode -1)
(tool-bar-mode -1)
\end{verbatim}

Disable the scroll bar. The functionality is ok sometimes, but it clashes with
the theming.

\begin{verbatim}
(scroll-bar-mode -1)
\end{verbatim}
\subsection{Lines}
\label{sec:org260742e}

Scroll conservatively values above 100 cause Emacs to scroll the
minimum number of lines required to get the cursor in position. The
default value of 0 causes Emacs to recenter the window.

\begin{verbatim}
(setq-default scroll-conservatively 101)
\end{verbatim}

Display line numbers for text buffers. This can be toggled in an individual
buffer with \texttt{M-x display-line-numbers-mode}.

\begin{verbatim}
(global-display-line-numbers-mode t)
\end{verbatim}

Highlight the currently selected line. This can be toggled in an individual
buffer with \texttt{M-x hl-line-mode}.

\begin{verbatim}
(global-hl-line-mode t)
\end{verbatim}
\subsection{Color Scheme}
\label{sec:org57c4fb2}

Use the \texttt{doom-dracula} theme from the \href{https://github.com/doomemacs/themes/tree/729ad034631cba41602ad9191275ece472c21941}{Doom Themes} package.

\begin{verbatim}
(add-to-list 'package-selected-packages 'doom-themes)
(load-theme 'doom-dracula t)
\end{verbatim}
\subsection{Modeline}
\label{sec:org3911adf}

Use \href{https://github.com/seagle0128/doom-modeline/tree/297b57585fe3b3de9e694512170c44c6e104808f}{Doom Modeline} to display a nicer modeline. Mainly, it:

\begin{itemize}
\item Uses more icons.
\item Displays a minimal amount of information while still keeping
important information such as:
\begin{itemize}
\item Syntax errors
\item Version control information
\end{itemize}
\end{itemize}

\begin{verbatim}
(add-to-list 'package-selected-packages 'doom-themes)
(doom-modeline-mode t)
\end{verbatim}
\section{Editor Completions}
\label{sec:orgff31008}

Editor completions refers to auto complete done within the editor context, as
opposed to code. Editor completion is used to complete prompts for things such
as selecting a file, buffer, or command.
\subsection{Ivy}
\label{sec:orgfe22080}

Editor completions are displayed using the \href{https://github.com/abo-abo/swiper?tab=readme-ov-file\#ivy}{Ivy} package. This provides a huge
improvement over the default built-in Emacs completion.

\begin{verbatim}
(add-to-list 'package-selected-packages 'ivy)
(ivy-mode t)
\end{verbatim}
\subsection{Counsel}
\label{sec:org0abfa22}

\href{https://github.com/abo-abo/swiper?tab=readme-ov-file\#counsel}{Counsel} provides functions that wrap ivy completion with some extra
features. For example, \texttt{counsel-M-x} is an \texttt{M-x} replacement that also displays
a keybinding if there is an active keybinding for the particular function.

\begin{verbatim}
(add-to-list 'package-selected-packages 'counsel)
(counsel-mode t)
\end{verbatim}

Enabling \texttt{counsel-mode} makes the \texttt{counsel-mode-map} keymap active. This keymap
defines several rebinds.


However, it does not provide a rebind for \texttt{counsel-switch-buffer}. We make this
our default (interactive) switch buffer command as it allows previewing the
contents of a buffer before switching.

\begin{verbatim}
(define-key counsel-mode-map (kbd "C-x b") #'counsel-switch-buffer)
\end{verbatim}
\section{LSP}
\label{sec:org7cb2ea7}

\subsection{Background}
\label{sec:org25c8f7d}
The LanguageServerProtocol defines a way for a language server to communicate
programming language specific information for a project to an IDE(Emacs). The
protocol defines things such as syntax checking, autocomplete, and code
formatting.
\subsection{Updating Eglot Package}
\label{sec:org8f55802}

Eglot is included in Emacs. However, Eglot can be upgraded to the latest version
with \texttt{M-x eglot-upgrade-eglot}.
\subsection{Obtaining Language Servers}
\label{sec:orge84f825}

Eglot is configured to run the most popular language servers by
default. However, they must still be installed on the system. Some popular
language servers include \texttt{rust-analyzer} for Rust.
\subsection{Enabling Eglot}
\label{sec:org3b1601b}

Eglot can be manually enabled on a buffer with \texttt{M-x eglot}. To enable it
automatically, you may call \texttt{eglot-ensure} on the buffer automatically through
hooks.

\begin{verbatim}
(add-hook 'rust-mode-hook #'eglot-ensure)
\end{verbatim}
