emacs.html
<div id="outline-container-org147c1d0" class="outline-2">
<h2 id="org147c1d0"><span class="section-number-2">8.</span> Formatting</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgb77b17d" class="outline-3">
<h3 id="orgb77b17d"><span class="section-number-3">8.1.</span> Tabs</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Emacs uses a combination of tabs and spaces when auto-indenting. This pleases
neither the spaces nor tabs crowds. Tabs are disabled to prevent the mixed use,
though opinionated languages will still find a way to use their correct
default. For example, Go will still use tabs when indenting.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">setq-default</span> indent-tabs-mode nil)
</pre>
</div>

<p>
Use a default tab width of 4 spaces.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">setq-default</span> tab-width 4)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4c6e6b8" class="outline-3">
<h3 id="org4c6e6b8"><span class="section-number-3">8.2.</span> Line Width</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Set a target line width of 80. Contents of a "paragraph" may be made to follow
the target line width through <code>M-x fill-paragraph</code> (default keybind <code>M-q</code>) or a
highlighted region with <code>M-x fill-region</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">setq-default</span> fill-column 80)
</pre>
</div>

<p>
Some languages have a different target line length.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">fill-column-100</span> ()
  (<span style="color: #a020f0;">setq-local</span> fill-column 100))

(add-hook 'rust-mode-hook #'fill-column-100)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc0de00f" class="outline-3">
<h3 id="orgc0de00f"><span class="section-number-3">8.3.</span> Delete Trailing Whitespace</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Trailing whitespace is usually unintended. These are whitespace characters
hanging at the end of the sentence or newlines/whitespace at the end of the
file. Trailing whitespace can be automatically deleted before save.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'before-save-hook #'delete-trailing-whitespace)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf88a19e" class="outline-3">
<h3 id="orgf88a19e"><span class="section-number-3">8.4.</span> Language Specific Autoformat</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Eglot provides 2 functions for formatting.
</p>

<ul class="org-ul">
<li><code>eglot-format</code> - Formats the selected region.</li>
<li><code>eglot-format-buffer</code> - Format the current buffer.</li>
</ul>

<p>
However, running these functions interactively is not needed as we can
automatically run <code>eglot-format-buffer</code> before save.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">eglot-maybe-format-buffer</span> ()
  (<span style="color: #a020f0;">when</span> (eglot-managed-p) (eglot-format-buffer)))

(add-hook 'before-save-hook #'eglot-maybe-format-buffer)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org68ef613" class="outline-2">
<h2 id="org68ef613"><span class="section-number-2">9.</span> Code Auto-Complete</h2>
<div class="outline-text-2" id="text-9">
<p>
Code auto-complete is handled by the <a href="https://company-mode.github.io/">Company</a> package. Company is an
autocompletion frontend that comes with many backends. Company comes with a lot
of built-in backends and usually selects the best choice among them for
auto-complete suggestions. One of the more useful backends is the Eglot backend
which is automatically used if the buffer has Eglot mode enabled.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'package-selected-packages 'company)
</pre>
</div>

<p>
Company mode is usually fine to enable globally. If the buffer doesn't have a
suitable backend, then it does nothing.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-company-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaa83484" class="outline-2">
<h2 id="orgaa83484"><span class="section-number-2">10.</span> Languages</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org0b08594" class="outline-3">
<h3 id="org0b08594"><span class="section-number-3">10.1.</span> Rust</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Rust is not built into Emacs so we install the <a href="https://github.com/rust-lang/rust-mode/tree/25d91cff281909e9b7cb84e31211c4e7b0480f94">Rust Mode</a> package.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'package-selected-packages 'rust-mode)
</pre>
</div>

<p>
Beyond that, there is not much to Rust as most of its functionality comes
throught Eglot + the <code>rust-analyzer</code> LSP.
</p>
</div>
</div>
<div id="outline-container-org7f149ae" class="outline-3">
<h3 id="org7f149ae"><span class="section-number-3">10.2.</span> Org Mode</h3>
<div class="outline-text-3" id="text-10-2">
<p>
Enable syntax highlighting for exported material html. Note that this will use
the currently active theme.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'package-selected-packages 'htmlize)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge7a83b3" class="outline-2">
<h2 id="orge7a83b3"><span class="section-number-2">11.</span> Elisp Concepts</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgdac3d8b" class="outline-3">
<h3 id="orgdac3d8b"><span class="section-number-3">11.1.</span> Interactive Commands</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Interactive functions that can be run "interactively". Here, interactively maens
that they can be run through <code>M-x</code>. Interactive functions are defined by adding
(interactive) in their function definition.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my-function</span> ()
  <span style="color: #8b2252;">"Do a thing."</span>
  (message <span style="color: #8b2252;">"Hello World"</span>))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my-interactive-function</span> ()
  <span style="color: #8b2252;">"Do a thing."</span>
  (<span style="color: #a020f0;">interactive</span>)
  (message <span style="color: #8b2252;">"Hello World"</span>))
</pre>
</div>

<p>
Interactive functions also have a sophisticated mechanism of querying the user
for standard options and passing them as flags. See the <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Using-Interactive.html">Emacs Documentation</a> for
"Using interactive" for more details.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: will@wmedrano.dev</p>
<p class="date">Created: 2025-05-27 Tue 22:16</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
