emacs.tex
\section{Formatting}
\label{sec:org77a5df4}

\subsection{Tabs}
\label{sec:orgdb600f9}

Emacs uses a combination of tabs and spaces when auto-indenting. This pleases
neither the spaces nor tabs crowds. Tabs are disabled to prevent the mixed use,
though opinionated languages will still find a way to use their correct
default. For example, Go will still use tabs when indenting.

\begin{verbatim}
(setq-default indent-tabs-mode nil)
\end{verbatim}

Use a default tab width of 4 spaces.

\begin{verbatim}
(setq-default tab-width 4)
\end{verbatim}
\subsection{Line Width}
\label{sec:orgd9ade2c}

Set a target line width of 80. Contents of a "paragraph" may be made to follow
the target line width through \texttt{M-x fill-paragraph} (default keybind \texttt{M-q}) or a
highlighted region with \texttt{M-x fill-region}.

\begin{verbatim}
(setq-default fill-column 80)
\end{verbatim}

Some languages have a different target line length.

\begin{verbatim}
(defun fill-column-100 ()
  (setq-local fill-column 100))

(add-hook 'rust-mode-hook #'fill-column-100)
\end{verbatim}
\subsection{Delete Trailing Whitespace}
\label{sec:orgc028895}

Trailing whitespace is usually unintended. These are whitespace characters
hanging at the end of the sentence or newlines/whitespace at the end of the
file. Trailing whitespace can be automatically deleted before save.

\begin{verbatim}
(add-hook 'before-save-hook #'delete-trailing-whitespace)
\end{verbatim}
\subsection{Language Specific Autoformat}
\label{sec:orgcbf0c33}

Eglot provides 2 functions for formatting.

\begin{itemize}
\item \texttt{eglot-format} - Formats the selected region.
\item \texttt{eglot-format-buffer} - Format the current buffer.
\end{itemize}

However, running these functions interactively is not needed as we can
automatically run \texttt{eglot-format-buffer} before save.

\begin{verbatim}
(defun eglot-maybe-format-buffer ()
  (when (eglot-managed-p) (eglot-format-buffer)))

(add-hook 'before-save-hook #'eglot-maybe-format-buffer)
\end{verbatim}
\section{Code Auto-Complete}
\label{sec:org74b51ac}

Code auto-complete is handled by the \href{https://company-mode.github.io/}{Company} package. Company is an
autocompletion frontend that comes with many backends. Company comes with a lot
of built-in backends and usually selects the best choice among them for
auto-complete suggestions. One of the more useful backends is the Eglot backend
which is automatically used if the buffer has Eglot mode enabled.

\begin{verbatim}
(add-to-list 'package-selected-packages 'company)
\end{verbatim}

Company mode is usually fine to enable globally. If the buffer doesn't have a
suitable backend, then it does nothing.

\begin{verbatim}
(global-company-mode t)
\end{verbatim}
\section{Languages}
\label{sec:orge798ac9}

\subsection{Rust}
\label{sec:org7043f8e}

Rust is not built into Emacs so we install the \href{https://github.com/rust-lang/rust-mode/tree/25d91cff281909e9b7cb84e31211c4e7b0480f94}{Rust Mode} package.

\begin{verbatim}
(add-to-list 'package-selected-packages 'rust-mode)
\end{verbatim}

Beyond that, there is not much to Rust as most of its functionality comes
throught Eglot + the \texttt{rust-analyzer} LSP.
\subsection{Org Mode}
\label{sec:org26ea189}

Enable syntax highlighting for exported material html. Note that this will use
the currently active theme.

\begin{verbatim}
(add-to-list 'package-selected-packages 'htmlize)
\end{verbatim}
\section{Elisp Concepts}
\label{sec:orgba51f1a}

\subsection{Interactive Commands}
\label{sec:org432f39c}

Interactive functions that can be run "interactively". Here, interactively maens
that they can be run through \texttt{M-x}. Interactive functions are defined by adding
(interactive) in their function definition.

\begin{verbatim}
(defun my-function ()
  "Do a thing."
  (message "Hello World"))

(defun my-interactive-function ()
  "Do a thing."
  (interactive)
  (message "Hello World"))
\end{verbatim}

Interactive functions also have a sophisticated mechanism of querying the user
for standard options and passing them as flags. See the \href{https://www.gnu.org/software/emacs/manual/html\_node/elisp/Using-Interactive.html}{Emacs Documentation} for
"Using interactive" for more details.
\end{document}
